// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// * сравнить быстродействие с вариантом решения через string
using System;
using System.Diagnostics;


Math.Floor(Math.Log10(n) + 1);

 x = 887979789; x.toString().Count();

Stopwatch sw1 = new Stopwatch();
            sw1.Start();
            for (int i = 0; i < size; ++i) samples[i].Digits_IfChain();
            sw1.Stop();
            Console.WriteLine($"IfChain: {sw1.ElapsedMilliseconds} ms");